Repository: BenjaminBriggs/sudoku-core
Catalog: Sources/SudokuCore/Localizable.xcstrings
Source language: en_gb
Languages: de, es, fr, ja, ko, zh_hans

source: %lld-Fish
de: %lld-Fisch
es: %lld-Pez
fr: Poisson %lld
ja: %lld-フィッシュ
ko: %lld-피쉬
zh_hans: %lld鱼

source: Any cell that can see both 'roof' cells cannot contain %lld, as this would create a contradiction.
de: Jede Zelle, die beide "Dach"-Zellen sehen kann, kann nicht %lld enthalten, da dies einen Widerspruch darstellen würde.
es: Cualquier celda que pueda ver ambas celdas "techo" no puede contener %lld, ya que se crearía una contradicción.
fr: Toute cellule qui peut voir les deux cellules "toit" ne peut pas contenir %lld, car cela créerait une contradiction.
ja: 両方の「屋根」のセルを見ることができるセルは、%lldを含むことができない。
ko: '지붕' 셀을 모두 볼 수 있는 셀은 모순이 발생하므로 %lld를 포함할 수 없습니다.
zh_hans: 任何可以同时看到 "屋顶 "单元格的单元格都不能包含 %lld，因为这会产生矛盾。

source: Any cell that can see both of these cells cannot contain %lld.
de: Jede Zelle, die beide dieser Zellen sieht, kann %lld nicht enthalten.
es: Cualquier celda que pueda ver ambas celdas no puede contener %lld.
fr: Toute case qui voit ces deux cases ne peut pas contenir %lld.
ja: これら2つのセルを両方見える任意のセルには%lldを入れられません。
ko: 이 두 칸 모두 볼 수 있는 칸에는 %lld이(가) 들어갈 수 없습니다.
zh_hans: 能看到这两个单元格的其它格不能包含%lld。

source: Because of the fins, eliminations are restricted to cells that can see all fin positions.
de: Aufgrund der Flossen sind Eliminierungen auf Zellen beschränkt, die alle Flossenpositionen sehen können.
es: Debido a las aletas, las eliminaciones están restringidas a las celdas que puedan ver todas las posiciones de las aletas.
fr: En raison des nageoires, les éliminations sont limitées aux cellules qui peuvent voir toutes les positions des nageoires.
ja: フィンの影響で、削除はすべてのフィンの位置が見えるセルに限定されます。
ko: 핀들로 인해 제거는 모든 핀 위치를 볼 수 있는 셀로 제한됩니다.
zh_hans: 由于鳍的存在，仅限于能看到所有鳍位置的单元格进行消除。

source: Because this house must contain a %lld, we know that it has to be on of these cells.
de: Da dieses Haus ein %lld enthalten muss, wissen wir, dass es sich um eine dieser Zellen handeln muss.
es: Como esta casa debe contener un %lld, sabemos que tiene que ser una de estas casillas.
fr: Comme cette maison doit contenir un %lld, nous savons qu'il doit s'agir d'une de ces cellules.
ja: この家には%lldが含まれていなければならないので、これらのマスのどれかでなければならないことがわかる。
ko: 이 집에는 %lld가 포함되어야 하므로 이 셀 중 하나에 있어야 한다는 것을 알고 있습니다.
zh_hans: 因为这个房子必须包含一个 %lld，所以我们知道它必须是这些单元格中的一个。

source: Because this house must contain a %lld, we know that it has to be one of these cells.
de: Weil dieses Haus ein %lld enthalten muss, wissen wir, dass es in einer dieser Zellen sein muss.
es: Como esta casa debe contener un %lld, sabemos que tiene que estar en una de estas celdas.
fr: Comme cette maison doit contenir un %lld, il doit être dans l'une de ces cases.
ja: このハウスには必ず %lld が入るため、このセルのいずれかであることが分かります。
ko: %lld이(가) 이 집에 꼭 있어야 하므로, 해당 숫자는 이 칸들 중 하나에 있어야 합니다.
zh_hans: 由于此宫必须包含%lld，因此它一定落在这些单元格之一。

source: Cell A
de: Zelle A
es: Celda A
fr: Case A
ja: セルA
ko: A 칸
zh_hans: A格

source: Cell B
de: Zelle B
es: Celda B
fr: Case B
ja: セルB
ko: B 칸
zh_hans: B格

source: Digit %lld appears exactly twice in a row and exactly twice in a column, with one cell from each sharing the same box.
de: Ziffer %lld kommt genau zweimal in einer Zeile und zweimal in einer Spalte vor, wobei jeweils eine Zelle in beiden Gruppen im selben Block liegt.
es: El dígito %lld aparece exactamente dos veces en una fila y dos veces en una columna, compartiendo una celda en la misma caja.
fr: Le chiffre %lld apparaît exactement deux fois sur une ligne et deux fois sur une colonne, avec une case de chaque partageant le même bloc.
ja: 数字%lldが1行にちょうど2回、1列にも2回現れ、それぞれのうち1つが同じボックスを共有します。
ko: 숫자 %lld이(가) 한 행과 한 열에 각각 두 번씩 등장하며, 각 행과 열의 칸이 같은 박스를 공유합니다.
zh_hans: 数字%lld在一行和一列中各出现两次，且每行/列有一个单元格在同一宫内。

# Each %@ can only contain the digit %lld once.
source: Each %1$@ can only contain the digit %2$lld once.
de: Jeder %1$@ kann die Ziffer %2$lld nur einmal enthalten.
es: Cada %1$@ sólo puede contener el dígito %2$lld una vez.
fr: Chaque %1$@ ne peut contenir qu'une seule fois le chiffre %2$lld.
ja: 各%1$@は数字%2$lldを一度だけ含むことができる。
ko: 각 %1$@에는 숫자 %2$lld를 한 번만 포함할 수 있습니다.
zh_hans: 每个 %1$@ 只能包含一次数字 %2$lld。

source: Either way, %lld must appear in one of the wing cells.
de: In jedem Fall muss %lld in einer der Flügelzellen enthalten sein.
es: De cualquier manera, %lld debe aparecer en una de las celdas de las alas.
fr: Dans tous les cas, %lld doit apparaître dans une des cellules des ailes.
ja: いずれの場合でも、%lldはウィングセルのいずれかに入らなければなりません。
ko: 어느 경우든, %lld은(는) 윙 셀 중 하나에 나타나야 합니다.
zh_hans: 无论如何，%lld必须出现在其中一个翅膀单元格中。

source: Finned %lld-Fish
de: Beflossener %lld-Fisch
es: Pez con aletas de %lld
fr: Poisson à nageoires %lld
ja: フィン付き%lld-フィッシュ
ko: 핀드 %lld-피쉬
zh_hans: 带鳍%lld鱼

source: Finned Jellyfish
de: Beflossenes Jellyfish
es: Medusa con aletas
fr: Méduse à nageoires
ja: フィン付きジェリーフィッシュ
ko: 핀드 젤리피쉬
zh_hans: 带鳍水母鱼

source: Finned Swordfish
de: Beflossenes Swordfish
es: Pez espada con aletas
fr: Espadon à nageoires
ja: フィン付きソードフィッシュ
ko: 핀드 소드피쉬
zh_hans: 带鳍剑鱼

source: Finned X-Wing
de: Beflossener X-Wing
es: X-Wing con aletas
fr: X-Aile à nageoires
ja: フィン付きXウィング
ko: 핀드 X-윙
zh_hans: 带鳍X翼

source: However, this pattern has extra candidates (fins) that prevent it from being a perfect fish:
de: Jedoch hat dieses Muster zusätzliche Kandidaten (Flossen), die verhindern, dass es ein perfektes Fischmuster ist:
es: Sin embargo, este patrón tiene candidatos adicionales (aletas) que le impiden ser un pez perfecto:
fr: Cependant, ce motif a des candidats supplémentaires (nageoires) qui l'empêchent d'être un poisson parfait :
ja: しかし、このパターンには追加の候補（フィン）があり、完全なフィッシュとならないようにしています:
ko: 그러나 이 패턴에는 추가 후보(핀)가 있어 완벽한 피쉬가 되지 못합니다:
zh_hans: 然而，这种模式有额外的候选数（鳍），使其不成为完美的鱼：

source: If Cell A is %1$lld, Cell B must be %2$lld. If Cell A is %3$lld, the strong link forces %4$lld away, so Cell B is still %5$lld. Either way, one of these cells contains %6$lld.
de: Wenn Zelle A %1$lld ist, muss Zelle B %2$lld sein. Ist Zelle A %3$lld, verdrängt der starke Link %4$lld, also bleibt Zelle B %5$lld. So oder so enthält eine dieser Zellen %6$lld.
es: Si la Celda A es %1$lld, la Celda B debe ser %2$lld. Si la Celda A es %3$lld, el enlace fuerte elimina %4$lld, así que la Celda B sigue siendo %5$lld. De cualquier modo, una de estas celdas contiene %6$lld.
fr: Si la case A est %1$lld, la case B doit être %2$lld. Si la case A est %3$lld, le lien fort exclut %4$lld, donc la case B est quand même %5$lld. Dans tous les cas, une de ces cases contient %6$lld.
ja: セルAが%1$lldの場合、セルBは%2$lldになります。セルAが%3$lldの場合、強リンクによって%4$lldが除外され、セルBはやはり%5$lldとなります。どちらにしても、この2つのセルのうち1つが%6$lldを持ちます。
ko: A 칸에 %1$lld이(가) 있다면 B 칸은 %2$lld이(가) 됩니다. A 칸이 %3$lld이면 강한 연결로 %4$lld이(가) 제외되어 B 칸은 여전히 %5$lld입니다. 두 경우 모두 이 칸들 중 하나에 %6$lld이(가) 있습니다.
zh_hans: 若A格为%1$lld，B格为%2$lld。若A格为%3$lld，强链排除%4$lld，故B格仍为%5$lld。无论如何，二者之一包含%6$lld。

# In these %@ %@, the digit %lld can only appear in %@ %@.
source: In these %1$@ %2$@, the digit %3$lld can only appear in %4$@ %5$@.
de: In diesen %1$@ %2$@ kann die Ziffer %3$lld nur in %4$@ %5$@ erscheinen.
es: En estos %1$@ %2$@, el dígito %3$lld sólo puede aparecer en %4$@ %5$@.
fr: Dans ces %1$@ %2$@, le chiffre %3$lld ne peut apparaître que dans %4$@ %5$@.
ja: これらの %1$@ %2$@ では、数字 %3$lld は %4$@ %5$@ にしか現れない。
ko: 이 %1$@ %2$@에서 숫자 %3$lld는 %4$@ %5$@에만 나타날 수 있습니다.
zh_hans: 在这些 %1$@ %2$@ 中，数字 %3$lld 只能出现在 %4$@ %5$@ 中。

# In this %@, all candidates for digit %lld are in the same house.
source: In this %1$@, all candidates for digit %2$lld are in the same house.
de: In diesem %1$@ befinden sich alle Kandidaten für die Ziffer %2$lld im selben Haus.
es: En este %1$@, todos los candidatos para el dígito %2$lld están en la misma casa.
fr: Dans ce %1$@, tous les candidats pour le chiffre %2$lld sont dans la même maison.
ja: この %1$@ では、数字 %2$lld の候補はすべて同じ家にある。
ko: 이 %1$@에서 숫자 %2$lld에 대한 모든 후보가 같은 집에 있습니다.
zh_hans: 在这个 %1$@ 中，数字 %2$lld 的所有候选数都在同一间房子里。

# In this %@, only these cells contain a %lld as a candidate
source: In this %1$@, only these cells contain a %2$lld as a candidate
de: In diesem %1$@ enthalten nur diese Zellen einen %2$lld als Kandidaten
es: En este %1$@, sólo estas celdas contienen un %2$lld como candidato
fr: Dans cette %1$@, seules ces cellules contiennent un %2$lld comme candidat.
ja: この%1$@では、これらのセルだけが候補として%2$lldを含む
ko: 이 %1$@에서는 이 셀에만 %2$lld가 후보로 포함되어 있습니다.
zh_hans: 在此 %1$@ 中，只有这些单元格包含作为候选数的 %2$lld

# In this house, %lld can only be in cells in one %@.
source: In this house, %1$lld can only be in cells in one %2$@.
de: In diesem Haus kann %1$lld nur in Zellen in einem %2$@ vorkommen.
es: En esta casa, %1$lld sólo puede estar en celdas de una %2$@.
fr: Dans cette maison, %1$lld ne peut se trouver que dans les cellules d'une %2$@.
ja: この家では、%1$lldは1つの%2$@のセルにしか入らない。
ko: 이 하우스에서 %1$lld는 하나의 %2$@에 있는 셀에만 있을 수 있습니다.
zh_hans: 在这所房子里，%1$lld 只能出现在一个 %2$@ 的单元格中。

# Look at %@ %@ and %@ %@ forming a %@ pattern for digit %lld:
source: Look at %1$@ %2$@ and %3$@ %4$@ forming a %5$@ pattern for digit %6$lld:
de: Betrachten Sie %1$@ %2$@ und %3$@ %4$@, die ein %5$@-Muster für die Ziffer %6$lld bilden:
es: Mira %1$@ %2$@ y %3$@ %4$@ formando un patrón %5$@ para el dígito %6$lld:
fr: Regardez %1$@ %2$@ et %3$@ %4$@ formant un motif %5$@ pour le chiffre %6$lld :
ja: 1$@ %2$@ と %3$@ %4$@ を見て、数字 %6$lld の %5$@ パターンを形成する：
ko: 1$@ %2$@와 %3$@ %4$@가 숫자 %6$lld에 대해 %5$@ 패턴을 형성하는 것을 보세요:
zh_hans: 请看 %1$@ %2$@ 和 %3$@ %4$@ 构成了数字 %6$lld 的 %5$@ 模式：

source: Look at the candidates for digit %lld in this box — they form an Empty Rectangle pattern.
de: Schau dir die Kandidaten für Ziffer %lld in diesem Block an – sie bilden ein Leeres-Rechteck-Muster.
es: Mira los candidatos para el dígito %lld en esta caja: forman un patrón de Rectángulo Vacío.
fr: Regardez les candidats pour le chiffre %lld dans ce bloc — ils forment un motif de Rectangle Vide.
ja: このボックス内の数字%lldの候補を見てください ― Empty Rectangleパターンになっています。
ko: 이 박스에서 숫자 %lld의 후보를 보면, 빈 사각형 패턴을 이룹니다.
zh_hans: 请看本区块内数字%lld的候选格——它们形成了空矩形模式。

source: Look at these %1$@ cells in the same %2$@. Together, they contain only %3$@ candidates: %4$@.
de: Betrachten Sie diese %1$@-Zellen im gleichen %2$@. Zusammen enthalten sie nur %3$@ Kandidaten: %4$@.
es: Mira estas celdas %1$@ en la misma %2$@. Juntas, sólo contienen candidatos %3$@: %4$@.
fr: Regardez ces %1$@ cellules dans le même %2$@. Ensemble, elles ne contiennent que des candidats %3$@ : %4$@.
ja: 同じ %2$@ にあるこれらの %1$@ セルを見てください。これらには%3$@の候補しかない：%4$@.
ko: 같은 %2$@에 있는 이 %1$@ 셀을 보세요. 모두 합쳐서 %3$@ 후보만 포함되어 있습니다: %4$@.
zh_hans: 看看这些 %1$@ 单元格中的 %2$@。它们总共只包含 %3$@ 个候选字：%4$@.

source: Look at these cells forming a Skyscraper pattern for digit %lld:
de: Betrachten Sie diese Zellen, die ein Wolkenkratzer-Muster für die Ziffer %lld bilden:
es: Observa estas celdas formando un patrón Rascacielos para el dígito %lld:
fr: Regardez ces cellules formant un motif de gratte-ciel pour le chiffre %lld :
ja: 数字%lldに対してスカイスクレイパーのパターンを形成しているセルを見てみよう：
ko: 숫자 %lld에 대해 스카이스크래퍼 패턴을 형성하는 이 셀을 보세요:
zh_hans: 请看这些单元格组成了数字 %lld 的摩天大楼图案：

source: Look at these cells forming a Two-String Kite pattern for digit %lld:
de: Beachte diese Zellen, sie bilden für Ziffer %lld ein Zwei-Faden-Drachen-Muster:
es: Observa estas celdas que forman un patrón de Two-String Kite para el dígito %lld:
fr: Regardez ces cases formant un motif Two-String Kite pour le chiffre %lld :
ja: これらのセルで%lldのTwo-String Kiteパターンができます:
ko: 다음 칸들이 숫자 %lld에 대한 투스트링 카이트 패턴을 형성합니다:
zh_hans: 请看这些单元格，形成了数字%lld的双弦风筝模式：

source: Look at these three cells forming a %@ pattern:
de: Schauen Sie sich diese drei Zellen an, die ein %@ Muster formen:
es: Mira estas tres casillas formando un patrón de %@:
fr: Regardez ces trois cellules formant un motif de %@ :
ja: これらの3つのセルが%@パターンを形成しているのを見てください:
ko: 다음 세 개의 셀이 %@ 패턴을 형성하는 것을 보세요:
zh_hans: 看看这三个单元格，它们形成了一个%@模式：

source: Look at these two cells — they both contain candidates {%1$lld, %2$lld}, forming a W-Wing pattern.
de: Sieh dir diese beiden Zellen an – beide enthalten Kandidaten {%1$lld, %2$lld}, das ergibt ein W-Wing-Muster.
es: Mira estas dos celdas: ambas tienen candidatos {%1$lld, %2$lld}, formando un patrón W-Wing.
fr: Regardez ces deux cases — elles contiennent toutes les deux les candidats {%1$lld, %2$lld}, formant un motif W-Wing.
ja: この2つのセルにはどちらも候補{%1$lld, %2$lld}があり、W-Wingパターンを構成しています。
ko: 이 두 칸을 보세요 — 둘 다 후보 {%1$lld, %2$lld}을(를) 가지고 있으며, W-윙 패턴을 이룹니다.
zh_hans: 看这两个单元格——它们都包含候选数 {%1$lld, %2$lld}，形成了W翼型。

# Look at this %@. Pay attention to where digits %@ can appear.
source: Look at this %1$@. Pay attention to where digits %2$@ can appear.
de: Schau dir dieses %1$@ an. Achten Sie darauf, wo die Ziffern %2$@ erscheinen können.
es: Mira este %1$@. Presta atención a dónde pueden aparecer los dígitos %2$@.
fr: Regardez ce %1$@. Faites attention à l'endroit où les chiffres %2$@ peuvent apparaître.
ja: この%1$@を見てください。桁%2$@がどこに現れるか注意してください。
ko: 이 %1$@을 보세요. 2$@ 숫자가 어디에 나타날 수 있는지 주의하세요.
zh_hans: 看这个 %1$@。注意数字 %2$@ 可能出现的位置。

source: No matter which value goes in the pivot, at least one of the wings must contain %lld.
de: Egal, welcher Wert in der Pivotzelle steht, mindestens einer der Flügel muss %lld enthalten.
es: No importa qué valor vaya en el pivote, al menos una de las alas debe contener %lld.
fr: Quel que soit la valeur du pivot, au moins une des ailes doit contenir %lld.
ja: どの値がピボットに入っても、少なくとも1つのウィングには%lldが含まれなければなりません。
ko: 피벗에 어떤 값이 들어가도, 최소한 윙 중 하나는 %lld을(를) 포함해야 합니다.
zh_hans: 无论基点填入哪个值，至少有一个翅膀必须包含%lld。

source: One end of the strong link aligns with the rectangle. If %1$lld is not at that end, the rectangle forces %2$lld into a position that eliminates it from the target cell.
de: Ein Ende des starken Links stimmt mit dem Rechteck überein. Ist %1$lld nicht am Ende, zwingt das Rechteck %2$lld in eine Position, die es aus der Zielzelle entfernt.
es: Un extremo del enlace fuerte se alinea con el rectángulo. Si %1$lld no está en ese extremo, el rectángulo fuerza que %2$lld esté en una posición que lo elimina de la celda objetivo.
fr: Une extrémité du lien fort s'aligne avec le rectangle. Si %1$lld n'est pas à cette extrémité, le rectangle force %2$lld dans une position qui l'élimine de la case cible.
ja: 強リンクの一端が長方形に揃っています。その端に%1$lldがない場合、長方形は%2$lldを標的セルから除外する位置に導きます。
ko: 강한 연결의 한쪽 끝이 사각형과 맞닿아 있습니다. %1$lld이(가) 그 끝에 없다면, 사각형은 %2$lld을(를) 위치에 강제하여 목표 칸에서 제거하게 만듭니다.
zh_hans: 强链一端与矩形对齐。如果%1$lld不在此端，矩形会将%2$lld限定到排除目标格的位置。

source: One of these two cells must contain %lld.
de: Eine dieser beiden Zellen muss %lld enthalten.
es: Una de estas dos celdas debe contener %lld.
fr: L'une de ces deux cases doit contenir %lld.
ja: この2つのセルのいずれかに%lldが入ります。
ko: 이 두 칸 중 하나에는 반드시 %lld이(가) 들어갑니다.
zh_hans: 这两个格必有一个包含%lld。

source: Pivot
de: Drehpunkt
es: Pivote
ja: ピボット
ko: 피벗
zh_hans: 枢轴

source: Remove %lld as a candidate from these cells in the same house.
de: Entfernen Sie %lld als Kandidaten aus diesen Zellen im selben Haus.
es: Eliminar %lld como candidato de estas celdas en la misma casa.
fr: Retirez %lld comme candidat de ces cellules dans la même maison.
ja: 同じ家にあるこれらのセルから候補として%lldを取り除く。
ko: 같은 집의 이 셀에서 %lld를 후보로 제거합니다.
zh_hans: 将 %lld 作为候选数字从这些单元格中删除。

source: Remove %lld from one of these positions to resolve the conflict.
de: Entfernen Sie %lld von einer dieser Positionen, um den Konflikt zu lösen.
es: Elimine %lld de una de estas posiciones para resolver el conflicto.
fr: Retirez %lld de l'une de ces positions pour résoudre le conflit.
ja: 紛争を解決するために、これらの位置の一つから%lldを取り除く。
ko: 충돌을 해결하려면 이러한 위치 중 하나에서 %lld를 제거합니다.
zh_hans: 将 %lld 从其中一个位置移除，以解决冲突。

source: Remove this value and try again.
de: Entfernen Sie diesen Wert und versuchen Sie es erneut.
es: Elimine este valor e inténtelo de nuevo.
fr: Supprimez cette valeur et réessayez.
ja: この値を削除して再試行する。
ko: 이 값을 제거하고 다시 시도하세요.
zh_hans: 删除此值并重试。

source: Since %1$lld must be in one of these cells, it can't appear anywhere else in this %2$@.
de: Da %1$lld in einer dieser Zellen sein muss, kann es sonst nirgends in diesem %2$@ stehen.
es: Como %1$lld debe estar en una de estas celdas, no puede aparecer en otro lugar en este %2$@.
fr: Puisque %1$lld doit être dans l'une de ces cases, il ne peut pas apparaître ailleurs dans ce(tte) %2$@.
ja: このセルのいずれかに%1$lldが入るため、この%2$@の他の場所には現れません。
ko: %1$lld는 이 칸들 중 하나에 반드시 있어야 하므로, 이 %2$@의 다른 곳에 나타날 수 없습니다.
zh_hans: 因为%1$lld必须在这些单元格中，所以它不能出现在该%2$@的其他地方。

source: Since %1$lld must be in one of these cells, it can't appear elsewhere else in this %2$@.
de: Da %1$lld in einer dieser Zellen stehen muss, kann es nirgendwo anders in diesem %2$@ vorkommen.
es: Como %1$lld debe estar en una de estas celdas, no puede aparecer en ningún otro lugar de este %2$@.
fr: Puisque %1$lld doit se trouver dans l'une de ces cellules, il ne peut apparaître ailleurs dans cette %2$@.
ja: 1$lldはこれらのセルのいずれかになければならないので、この%2$@の他の場所に現れることはない。
ko: 1$lld는 이러한 셀 중 하나에 있어야 하므로 이 %2$@의 다른 곳에는 표시할 수 없습니다.
zh_hans: 由于 %1$lld 必须出现在其中一个单元格中，因此它不能出现在 %2$@ 中的其他地方。

source: Since %lld must be in one of these cells, it can't appear elsewhere in this house.
de: Da %lld in einer dieser Zellen stehen muss, kann es nirgendwo anders in diesem Haus vorkommen.
es: Como %lld debe estar en una de estas casillas, no puede aparecer en ningún otro lugar de esta casa.
fr: Puisque %lld doit se trouver dans l'une de ces cellules, il ne peut pas apparaître ailleurs dans cette maison.
ja: lldはこれらのマスのいずれかになければならないので、この家の他の場所に現れることはない。
ko: 는 이 셀 중 하나에 있어야 하므로 이 집의 다른 곳에 나타날 수 없습니다.
zh_hans: 由于 %lld 必须出现在其中一个单元格中，因此它不能出现在这个房子的其他地方。

source: Since these %1$@ cells must contain %2$@, we can remove all other candidates from them.
de: Da diese %1$@-Zellen %2$@ enthalten müssen, können wir alle anderen Kandidaten aus ihnen entfernen.
es: Como estas celdas %1$@ deben contener %2$@, podemos eliminar de ellas todos los demás candidatos.
fr: Puisque ces cellules %1$@ doivent contenir %2$@, nous pouvons en supprimer tous les autres candidats.
ja: これらの%1$@セルには%2$@が含まれていなければならないので、他の候補をすべて取り除くことができる。
ko: 이 %1$@ 셀에는 %2$@이 포함되어야 하므로 다른 모든 후보를 제거할 수 있습니다.
zh_hans: 由于这些 %1$@ 单元格必须包含 %2$@，因此我们可以从中删除所有其他候选单元格。

source: So, the red cells cannot be %lld.
de: Die roten Zellen können also nicht %lld sein.
es: Por tanto, las casillas rojas no pueden ser %lld.
fr: Les globules rouges ne peuvent donc pas être %lld.
ja: つまり、赤いセルは%lldにはなり得ない。
ko: 따라서 빨간색 셀은 %lld가 될 수 없습니다.
zh_hans: 因此，红色单元格不可能是 %lld。

# The correct placement for %lld is at %@.
source: The correct placement for %1$lld is at %2$@.
de: Die richtige Platzierung für %1$lld ist bei %2$@.
es: La colocación correcta de %1$lld es en %2$@.
fr: L'emplacement correct de %1$lld est à %2$@.
ja: 1$lld の正しい配置は %2$@ にある。
ko: 1$lld의 올바른 배치는 %2$@에 있습니다.
zh_hans: %1$lld 的正确位置在 %2$@。

source: The digit %1$lld appears exactly twice in two different %2$@, with one candidate in each %3$@ sharing the same %4$@.
de: Die Ziffer %1$lld erscheint genau zweimal in zwei verschiedenen %2$@, wobei ein Kandidat in jedem %3$@ denselben %4$@ hat.
es: El dígito %1$lld aparece exactamente dos veces en dos %2$@ diferentes, con un candidato en cada %3$@ compartiendo el mismo %4$@.
fr: Le chiffre %1$lld apparaît exactement deux fois dans deux %2$@ différents, avec un candidat dans chaque %3$@ partageant le même %4$@.
ja: 桁の数字 %1$lld は2つの異なる %2$@ にちょうど2回現れ、それぞれの %3$@ の1つの候補は同じ %4$@ を共有している。
ko: 숫자 %1$lld는 두 개의 다른 %2$@에 정확히 두 번 나타나며, 각 %3$@에서 하나의 후보가 동일한 %4$@를 공유합니다.
zh_hans: 数字 %1$lld 恰好在两个不同的 %2$@ 中出现两次，每个 %3$@ 中的一个候选数共享同一个 %4$@。

# The digits %@ can only appear in these %@ cells in this %@.
source: The digits %1$@ can only appear in these %2$@ cells in this %3$@.
de: Die Ziffern %1$@ können nur in diesen %2$@-Zellen in diesem %3$@ erscheinen.
es: Los dígitos %1$@ sólo pueden aparecer en estas celdas %2$@ en este %3$@.
fr: Les chiffres %1$@ ne peuvent apparaître que dans ces %2$@ cellules de ce %3$@.
ja: 数字 %1$@ は、この %3$@ の %2$@ セルにしか出現しない。
ko: 숫자 %1$@은 이 %3$@의 %2$@ 셀에만 나타날 수 있습니다.
zh_hans: 数字 %1$@ 只能出现在 %3$@ 中的这些 %2$@ 单元格中。

source: The pivot cell has 3 candidates. Each wing shares one candidate with the pivot, and both wings share %lld as their second candidate.
de: Die Pivotzelle hat 3 Kandidaten. Jeder Flügel teilt einen Kandidaten mit dem Pivot, und beide Flügel teilen %lld als ihren zweiten Kandidaten.
es: La celda pivote tiene 3 candidatos. Cada ala comparte un candidato con el pivote, y ambas alas comparten %lld como su segundo candidato.
fr: La cellule pivot a 3 candidats. Chaque aile partage un candidat avec le pivot, et les deux ailes partagent %lld comme deuxième candidat.
ja: ピボットセルには3つの候補があります。それぞれのウィングが1つの候補をピボットと共有し、両方のウィングが%lldをその2番目の候補として共有しています。
ko: 피벗 셀에는 후보가 3개 있습니다. 각 윙은 피벗과 하나의 후보를 공유하며, 두 윙은 두 번째 후보로 %lld을(를) 공유합니다.
zh_hans: 基点单元格有3个候选数。每个翅膀与基点共享一个候选数，且两个翅膀共同的第二个候选数为%lld。

source: The pivot cell shares one candidate with each wing. Both wings contain %lld as their second candidate.
de: Die Pivotzelle teilt einen Kandidaten mit jedem Flügel. Beide Flügel enthalten %lld als ihren zweiten Kandidaten.
es: La celda pivote comparte un candidato con cada ala. Ambas alas contienen %lld como su segundo candidato.
fr: La cellule pivot partage un candidat avec chaque aile. Les deux ailes contiennent %lld comme deuxième candidat.
ja: ピボットセルはそれぞれのウィングと1つの候補を共有しています。両方のウィングに%lldが共通の2番目の候補として含まれています。
ko: 피벗 셀은 각 윙과 하나의 후보를 공유합니다. 두 윙은 %lld을(를) 두 번째 후보로 포함합니다.
zh_hans: 基点单元格与每个翅膀共享一个候选数。两个翅膀的共同第二个候选数为%lld。

source: There is also a strong link for %lld — it appears exactly twice in this line.
de: Für %lld gibt es auch einen starken Link – die Ziffer kommt genau zweimal in dieser Reihe vor.
es: También hay un enlace fuerte para %lld: aparece exactamente dos veces en esta línea.
fr: Il y a aussi un lien fort pour %lld — il apparaît exactement deux fois dans cette ligne.
ja: また、%lldにも強リンクがあります — この行内でちょうど2つ現れます。
ko: %lld에 대한 강한 연결도 있습니다 — 이 줄에서 정확히 두 번 나타납니다.
zh_hans: 还有%lld的强链——它在本行恰好出现两次。

# There's a conflict with digit %lld in this %@.
source: There's a conflict with digit %1$lld in this %2$@.
de: Es gibt einen Konflikt mit der Ziffer %1$lld in diesem %2$@.
es: Hay un conflicto con el dígito %1$lld en este %2$@.
fr: Il y a un conflit avec le chiffre %1$lld dans ce %2$@.
ja: この %2$@ では、数字 %1$lld と矛盾しています。
ko: 이 %2$@에서 숫자 %1$lld와 충돌이 발생했습니다.
zh_hans: 在这个 %2$@ 中与数字 %1$lld 有冲突。

source: Therefore we can rule out %lld as a candidate from these cells.
de: Daher können wir %lld als Kandidaten für diese Zellen ausschließen.
es: Por lo tanto, podemos descartar %lld como candidato de estas celdas.
fr: Nous pouvons donc exclure %lld comme candidat dans ces cellules.
ja: したがって、これらのセルから%lldを候補から除外することができる。
ko: 따라서 이 셀에서 %lld를 후보에서 제외할 수 있습니다.
zh_hans: 因此，我们可以排除 %lld 作为这些单元格的候选数字。

# Therefore, %lld can be eliminated from all other cells in these %@ %@.
source: Therefore, %1$lld can be eliminated from all other cells in these %2$@ %3$@.
de: Daher kann %1$lld aus allen anderen Zellen in diesen %2$@ %3$@ eliminiert werden.
es: Por lo tanto, %1$lld puede eliminarse de todas las demás células de estos %2$@ %3$@.
fr: Par conséquent, %1$lld peut être éliminé de toutes les autres cellules dans ces %2$@ %3$@.
ja: したがって、%1$lldはこれらの%2$@ %3$@の他のすべてのセルから排除することができる。
ko: 따라서 %2$@ %3$@의 다른 모든 셀에서 %1$lld를 제거할 수 있습니다.
zh_hans: 因此，%1$lld 可以从这些 %2$@ %3$@ 中的所有其他单元格中排除。

# Therefore, %lld can be eliminated from cells in the core %@ that see all fins.
source: Therefore, %1$lld can be eliminated from cells in the core %2$@ that see all fins.
de: Daher kann %1$lld aus den Zellen im Kern %2$@, die alle Flossen sehen, eliminiert werden.
es: Por lo tanto, %1$lld puede eliminarse de las celdas del núcleo %2$@ que ven todas las aletas.
fr: Par conséquent, %1$lld peut être éliminé des cellules du noyau %2$@ qui voient toutes les ailettes.
ja: したがって、すべてのフィンが見えるコア%2$@のセルから%1$lldを取り除くことができる。
ko: 따라서 모든 지느러미를 볼 수 있는 코어 %2$@의 셀에서 %1$lld를 제거할 수 있습니다.
zh_hans: 因此，可以从看到所有鳍片的核心单元 %2$@ 中删除 %1$lld。
